"“%@” couldn’t be overwritten because the file isn't writable by you." = "„%@“ Не удается перезаписать файл, т.к Вам доступно только чтение.";
"Converting “%1$@” to “%2$@”" = "Конвертация „%1$@“ в „%2$@“";
"Couldn't copy unpacked files from working directory" = "Невозможно скопировать незапакованные файлы из рабочей папки.";
"Task complete" = "Задача выполнена";
"Splitting “%@”" = "Разделение „%@“";
"Please try again." = "Попробуйте еще раз.";
"Couldn't find working directory" = "Не найдена рабочая папка.";
"Invalid File" = "Неверный файл";
"Task cancelled" = "Задание отменено";
"The file “%@” was modified since it was split and can't be combined." = "Файл „%@“ был изменен после разделения и не может быть объединен.";
"The archive “%@” cannot be created because the existing archive cannot be overwritten." = "Не удается создать архив „%@“, т.к. существующий архив не может быть перезаписан.";
"“%@” already exists. Do you want to replace it?" = "Файл „%@“ уже существует. Заменить его?";
/* Navigation */
"Next" = "След.";
"Back" = "Назад";
"Replace" = "Заменить";
"Finish" = "Завершить";
"Finder" = "Finder";
"Export" = "Экспорт";
"I Agree" = "Я согласен";
"Done" = "Готово";

"An unknown error occurred, please make sure you have enough disk space and that you have permissions to write to the destination folder." = "Неизвестная ошибка. Убедитесь в наличии свободного места на диске и прав для записи в конечную папку.";
"Please enter the password to open “%@”" = "Введите пароль для доступа к „%@“";
"Create “%@”" = "Создать „%@“";
"Invalid password" = "Неверный пароль";
"The archive could not be opened, possibly because it is incomplete or corrupt." = "Не удается открыть архив. Возможно, он не полный или поврежден.";
"OK" = "OK";
"Clean temporary files" = "Очистить временные файлы";
"File could not be split because the disk is full." = "Файл не может быть разделен из-за отсутствия места на диске.";
"Combine “%@”" = "Объединить „%@“";
"Extract" = "Извлечь";
"A file or folder with the same name already exists in this location. Replacing it will overwrite its current contents." = "Файл или каталог с таким именем уже существует в указанной папке. Заменив его, вы перепишите его содержимое.";
"Select" = "Выбрать";
"Split “%@”" = "Разделить „%@“";
"Choose destination" = "Выбрать папку назначения";
"The file “%1$@” could not be opened because “%2$@” is full." = "Не удается открыть файла „%1$@“, т.к. „%2$@“ полон.";
"Extract “%@”" = "Извлечь „%@“";
"Cancelled" = "Отменено";
"Creating “%@”" = "Создание „%@“";
"Invalid Password" = "Неверный пароль";
"Opening “%1$@” (%2$lu of %3$lu)" = "Открытие „%1$@“ (%2$lu из %3$lu)";
"Please delete some files on your disk and try again." = "Удалите некоторые файлы на диске и повторите попытку.";
"The file “%1$@” could not be opened because you do not have permissions to write to “%2$@”." = "Не удается открыть „%1$@“, т.к. у вас нет прав для записи в „%2$@“.";
"Combining file “%@”" = "Объединение файла „%@“";
"Convert “%1$@” to “%2$@”" = "Конвертировать „%1$@“ в „%2$@“";
"“%@” couldn’t be overwritten because you don’t have permission to access it." = "Не удается перезаписать „%@“, т.к. у вас недостаточно прав.";
"Task failed" = "Ошибка выполнения";
"Try deleting files from %@ or opening the file to another disk." = "Попробуйте удалить файлы из %@ или извлечь архив на другой диск.";
"Try selecting an output folder that is writable by you." = "Выберите папку, которая доступна вам для записи.";
"Removing “%@”" = "Удаление „%@“";
"The passwords don't match." = "Пароли не совпадают.";
"Please enter your password again." = "Введите пароль еще раз.";
"Scanning “%@”" = "Сканирование „%@“";
"The file “%@” could not be opened." = "Невозможно открыть файл “%@”.";
"Files could not be combined because the disk is full." = "Не удается объединить файлы, т.к. диск полон.";
"Try opening the file to another disk." = "Попробуйте извлечь архив на другой диск.";
"Unkonwn Status" = "Статус неизвестен";
"The file “%1$@” could not be opened because “%2$@” is read-only." = "Файл „%1$@“ не может быть открыт, т.к „%2$@“ доступен только для чтения.";
"Try changing the permissions or chosing a different archive name." = "Измените права доступа или выберите другое имя.";
"The archive could not be opened because you entered an invalid password. Please try again." = "Не удается открыть архив из-за неверного пароля. Попробуйте еще раз.";
"Select default output folder" = "Выберите конечную папку по умолчанию";
"Open" = "Открыть";
"Combine" = "Объединить";
"Try chosing a different archive name." = "Выберите другое имя архива.";
"Opening “%@”" = "Открытие „%@“";
"%1$@ of %2$@ completed" = "Завершено: %1$@ из %2$@";
"Cancel" = "Отмена";
"Replace" = "Заменить";
"An unknown error occurred opening file “%1$@” to “%2$@”." = "Неизвестная ошибка при распаковке „%1$@“ в „%2$@“.";
"Error creating archive" = "Ошибка создания архива";
"Make sure that you can modify this archive before overwriting it, or choose another location." = "Убедитесь, что можете изменять этот архив или выберите другой каталог.";
"Cleaning up (this may take a few minutes)..." = "Очистка (может занять несколько минут)...";
"Success" = "Успешно";
"Extract:" = "Извлечь:";
"Try selecting a different output folder." = "Выберите другую конечную папку";
"File could not be split because an unexpected error occurred." = "Файл не может быть разделен из-за непредвиденной ошибки.";
"Unsupported" = "Не поддерживается";
"The archive is protected with a password." = "Архив защищен паролем.";

"Analyzing %ld out of %ld" = "Анализ %ld из %ld";
"Analyzing files" = "Анализ файлов";

"Verifying checksums" = "Проверка контрольных сумм";
"Checksumming split files" = "Создание контрольных сумм для разделенных файлов";
"Invalid chunk size: %g" = "Неверный размер блока: %g";

"Updates" = "Обновление";
"General" = "Общие";
"Advanced" = "Расширенные";
"File Types" = "Типы файлов";

"%1.1f TB" = "%1.1f Tб";
"%1.1f GB" = "%1.1f Гб";
"%1.1f MB" = "%1.1f Мб";
"%1.1f KB" = "%1.1f Кб";
"%i bytes" = "%i байт";
"%i byte" = "%i байт";

/* Extract */
"Extract from “%@”:" = "Извлечь из „%@“:";

/* Compression levels */
"None" = "Без сжатия";

/* Progress */
"%d of %lu files copied" = "Скопировано файлов: %d из %lu";
"Extracting “%@”" = "Распаковка „%@“";

/* Preview */
"Preview “%@”" = "Просмотр „%@“";
"Preview “%@”: %d file" = "Просмотр „%@“: %d файл";
"Preview “%@”: %d files" = "Просмотр „%@“: %d файлов";
"Preview:" = "Просмотр:";
"Preview: %lu files" = "Просмотр: %lu файлов";

/* Encryption */
"Passwords do not match" = "Пароли не совпадают";
"Please confirm password" = "Подтвердите пароль";
"Please enter a password" = "Введите пароль";

/* Errors */
"Archiver unauthorized" = "Archiver не авторизован";
"Multimedia Manipulation failed" = "Ошибка обработки мультимедиа";
"The created files couldn't be moved." = "Не удается переместить созданные файлы.";
"Please enter a value bigger than 1 and try again." = "Укажите значение больше 1 и повторите попытку.";
"Invalid password for “%@”, please try again." = "Неверный пароль для „%@“, повторите попытку.";
"Cannot combine a single checksum file." = "Одна контрольная сумма: объединение невозможно.";

"%@ of %@ files packed" = "Упаковано файлов: %@ из %@";
"%d of %d files copied" = "Скопировано файлов: %d из %d";
"%@ of %@" = "%@ из %@";

"TAR Archive (BZIP2 compression)" = "Архив TAR (сжатие BZIP2)";
"TAR Archive (GZIP compression)" = "Архив TAR (сжатие GZIP)";
"TAR Archive (Lempel-Ziv compression)" = "Архив TAR (сжатие Lempel-Ziv)";
"(uncompressed)" = "(без сжатия)";
"ZIP archive (WinZIP compatible)" = "Архив ZIP (совместим с WinZip)";
"7-ZIP archive (high compression and encryption)" = "Архив 7-ZIP (высокое сжатие и шифрование)";
/* TODO: not happy with translation below -- but adding "Pre" suffix sounds strange */
"Archiver (audio and image pre-compression)" = "Archiver (прекомпрессия аудио и изображений)";
"Apple disk image" = "Образ диска Apple";

"Detaching image" = "Отделение изображения";
"Copying files from mounted image" = "Копирование файлов из образа";
"Cleaning up" = "Очистка";
"Finishing" = "Завершение";
"Attaching image" = "Прикрепление изображения";

"Calculating size..." = "Вычисление размера...";

"%i File" = "%i файл";
"%i Files" = "%i файлов";

/* Navigation buttons */
"Convert" = "Конвертировать";
"Split" = "Разделить";
"Archive" = "Архив";
"Finder" = "Finder";

/* Top bar labels */
"Convert Archive:" = "Конвертировать:";
"Split File:" = "Разделить файл:";
"Create Archive:" = "Создать архив:";
"Choose format" = "Выберите формат";

"Archive encrypted" = "Архив зашифрован";

/* Status item -- currently unused */
"Quit" = "Выйти";
/* TODO: check difference between make archive and quick-make archive */
"Create Archive…" = "Создать архив…";
"Quick-Create Archive…" = "Быстрое создание…";
"Choose Where to Extract…" = "Укажите папку для извлечения…";
"Combine Files…" = "Объединить…";
"Extract Here…" = "Извлечь сюда…";
"Preferences…" = "Настройки…";
"Preview…" = "Просмотр…";
"Split File…" = "Разделить…";

"Check for Updates…" = "Проверить обновления…";

/* Sandbox authorization */
"Authorize" = "Авторизовать";
"Authorize…" = "Авторизовать…";
"Authorize All…" = "Авторизовать все…";
"Authorize Later" = "Авторизовать позже";
"Authorize Now…" = "Авторизовать сейчас…";
"Please authorize Archiver to work with files." = "Авторизуйте Archiver для работы с файлами.";
"Archiver needs your permission to work with files. Do you wish to authorize now?" = "Archiver требует разрешения для работы с файлами. Авторизовать сейчас?";
"If you choose to authorize later you will be asked for permission on an as needed basis when you work with specific files." = "Если отложить авторизацию, вы будете получать запросы на обработку некоторых файлов.";
"If you do not want to be asked about authorization again, please choose Authorize All and follow the on-screen instructions." = "Если не хотите получать сообщения об авторизации вновь, выберите Авторизовать все и следуйте инструкциям.";

/* Help menu */
"Acknowledgments" = "Правообладатели / Благодарности";
"Send Email..." = "Отослать e-mail...";
"Send Feedback..." = "Обратная связь...";
"License Agreement" = "Лицензионное соглашение";

"Creating RAR archives requires third-party software. To install:\n\n1. Download the RAR plugin" = "Для создания RAR-архивов необходимо стороннее ПО. Для установки:\n\n1. Скачайте плагин RAR";

"Creating RAR archives requires up-to-date third-party software. Choose Install to download and install the missing software." = "Для создания RAR-архивов необходимо стороннее ПО до настоящего времени. Нажмите установить для загрузки и установки недостающих элементов.";

"here" = "здесь";
"or visit https://incrediblebee.com/dl/rar\n\n2. Drag the RAR plugin to the drop area below and choose Install:" = "или посетите https://incrediblebee.com/dl/rar\n\n2. Перетяните плагин RAR в поле ниже и выберите Установить:";
"Install RAR plugin" = "Установить плагин RAR";
"Downloading RAR plugin..." = "Загрузка плагина RAR…";
"Install" = "Установить";
"Finish" = "Завершить";
"Download error" = "Ошибка загрузки";
"Please check your internet connection and try again" = "Проверьте интернет-соединение и повторите попытку";

"You only need to authorize a folder once."="Вам необходимо авторизовать папку лишь один раз.";

/* Self-update */
"An old version was found in the %@ folder. To avoid any confusion we recommended that you delete this old version." = "В папке %@ обнаружена старая версия программы. Во избежание ошибок рекомендуем удалить ее.";
"The update server could not be reached." = "Невозможно подключиться к серверу обновлений.";
"There was an error retrieving the update." = "Ошибка при попытке обновления.";
"Please make sure you are connected to the Internet and then try again. If you are connected to the Internet please try again later as the update server may be temporarily unavailable. If the problem persists then please report it." = "Проверьте, подключены ли вы к Интернет, и повторите попытку. Если подключение активно, попробуйте позже, т.к. сервер может быть временно недоступен. Если проблема не устранена, сообщите нам.";
"Please try again later as the update server may be temporarily unavailable. If the problem persists then please report it." = "Попробуйте позже, т.к. сервер может быть временно недоступен. Если проблема не устранена, сообщите нам.";

/* Uninstall old version */
"Delete Old Version" = "Удалить старую версию";
"Do not show this message again" = "Больше не показывать это сообщение";
"Do you want to delete the old version?" = "Удалить старую версию?";
"You are up to date!" = "Ваша версия актуальна!";
"You are running the latest version of %@." = "Вы используете последнюю версию %@.";
"Keep" = "Сохранить";
"Show in Finder" = "Показать в Finder";
"Report Problem…" = "Сообщить о проблеме…";
"Finder" = "Finder";

/* ADDED BY RUSSIAN LOCALIZER */
"RAR Archive (Roshal Archive)" = "Архив RAR (Архив Рошала)";

// Added in v3
"The archive could not be opened." = "Не удается открыть архив.";
"The archive “%@” could not be opened, possibly because it's incomplete or corrupt." = "Не удается открыть архив „%@“. Возможно, он не полный или поврежден.";
"The archives could not be opened." = "Не удается открыть архивы.";
"None of the archives could be opened, possibly because they are incomplete or corrupt." = "Не удается открыть вce архивы. Возможно, они не полные или повреждены.";
"Skip" = "Пропустить";
"NavButton.Archive" = "Архивировать";
"ArchiveName.Archive" = "Архив";
"No compression" = "Не сжимать";
"7zip compression" = "сжатие 7zip";
"Bzip compression" = "сжатие BZIP";

"Combine failed" = "Объединение не удалось";
"The files could not be combined, possibly because they are corrupt." = "Архивы не удалось объединить, возможно они не полные или повреждены.";
"Invalid Unicode characters" = "Недопустимый Unicode символ";
"Invalid starting character \"=\"" = "Неверный стартовый символ \"=\"";
